In [29]:
import pandas as pd
import numpy as np

In [49]:
pd.Series(np.random.seed(20))

Series([], dtype: float64)

In [57]:
data_first = pd.DataFrame(np.ones(shape=(4,4)),['A','B','C','D'], ['W','X','Y','Z'])

In [58]:
data_first

     W    X    Y    Z
A  1.0  1.0  1.0  1.0
B  1.0  1.0  1.0  1.0
C  1.0  1.0  1.0  1.0
D  1.0  1.0  1.0  1.0

In [54]:
data_first.lookup(['A','B'],['W','X'])

array([1., 1.])

In [76]:
data_second = pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'], ['W','X','Y','Z'])

In [77]:
data_first.loc['A']

W    1.0
X    1.0
Y    1.0
Z    1.0
Name: A, dtype: float64

In [78]:
pd.Series()

Series([], dtype: float64)

In [79]:
data_second > 0

       W      X      Y      Z
A   True   True   True  False
B  False   True   True  False
C   True   True   True  False
D  False  False  False   True
E  False   True   True   True

In [81]:
data_second[data_second > 0]

          W         X         Y         Z
A  0.883893  0.195865  0.357537       NaN
B       NaN  0.559696  0.939469       NaN
C  0.503097  0.406414  0.323461       NaN
D       NaN       NaN       NaN  0.245715
E       NaN  1.567633  1.051109  0.406368